EWSEditor/EwsPostExamples/GetNonIndexableItemDetails.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2013" />
  </soap:Header>
  <soap:Body >
    <m:GetNonIndexableItemDetails>
      <m:Mailboxes>
        <t:LegacyDN>/o=First Organization/ou=Exchange Administrative Group (FYT)/cn=Recipients/cn=35-Steve</t:LegacyDN>
      </m:Mailboxes>
      <m:SearchArchiveOnly>false</m:SearchArchiveOnly>
    </m:GetNonIndexableItemDetails>
  </soap:Body>
</soap:Envelope>
